add database_schema
